_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 46, 200)           1200      
_________________________________________________________________
batch_normalization_1 (Batch (None, 46, 200)           800       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 23, 200)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4600)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               588928    
_________________________________________________________________
dense_2 (Dense)              (None, 25)                3225      
_________________________________________________________________
dense_3 (Dense)              (None, 20)                520       
=================================================================
Total params: 594,673
Trainable params: 594,273
Non-trainable params: 400
_________________________________________________________________