_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 196, 200)          1200      
_________________________________________________________________
batch_normalization_1 (Batch (None, 196, 200)          800       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 98, 200)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 19600)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               10035712  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_3 (Dense)              (None, 16)                2064      
=================================================================
Total params: 10,105,440
Trainable params: 10,105,040
Non-trainable params: 400
_________________________________________________________________