_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 99, 200)           1200      
_________________________________________________________________
batch_normalization_1 (Batch (None, 99, 200)           800       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 49, 200)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 9800)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               5018112   
_________________________________________________________________
dense_2 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_3 (Dense)              (None, 9)                 1161      
=================================================================
Total params: 5,086,937
Trainable params: 5,086,537
Non-trainable params: 400
_________________________________________________________________