_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 200, 200)          1200      
_________________________________________________________________
batch_normalization_1 (Batch (None, 200, 200)          800       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 100, 200)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 20000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               10240512  
_________________________________________________________________
dense_2 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_3 (Dense)              (None, 16)                2064      
=================================================================
Total params: 10,310,240
Trainable params: 10,309,840
Non-trainable params: 400
_________________________________________________________________